# SlantedColumnGeometryTreatmentTop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SlantedColumnGeometryTreatmentTop Property
ParameterTypeId Class See Also
---
"Top Geometry Alignment"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SlantedColumnGeometryTreatmentTop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlantedColumnGeometryTreatmentTop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlantedColumnGeometryTreatmentTop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace